Тест_ЗУП_31_КОРП/src/Catalogs/ВопросыДляСобеседования/ВопросыДляСобеседования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВопросыДляСобеседования</name>
  <attributes>
    <name>ТипВопроса</name>
    <type>
      <types>EnumRef.ТипыВопросовПоМетодуСИвановой</types>
    </type>
  </attributes>
  <attributes>
    <name>Формулировка</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Подсказка</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОтображенияПодсказки</name>
    <type>
      <types>EnumRef.СпособыОтображенияПодсказок</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Ключи</name>
    <attributes>
      <name>ХарактеристикаПерсонала</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ХарактеристикиПерсонала</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеХарактеристики</name>
      <type>
        <types>Characteristic.ХарактеристикиПерсонала</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭлементарныйВопрос</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВопросыДляАнкетирования</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтветНаВопрос</name>
      <type>
        <types>Characteristic.ВопросыДляАнкетирования</types>
      </type>
    </attributes>
    <attributes>
      <name>Балл</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КлючевыеВопросы</name>
    <attributes>
      <name>ЭлементарныйВопрос</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВопросыДляАнкетирования</types>
      </type>
    </attributes>
    <attributes>
      <name>Предопределенный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Тест_ЗУП_31_КОРП/src/Catalogs/ВопросыДляСобеседования/Forms/ФормаВыбора/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Характеристика) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
				Список, "Ключи.ХарактеристикаПерсонала", Характеристика, ВидСравненияКомпоновкиДанных.Равно,, Истина);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
				Список, "Ключи.ХарактеристикаПерсонала", Характеристика, ВидСравненияКомпоновкиДанных.Равно,, Ложь);
	КонецЕсли;
				
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Элементы.Список.Обновить();
	Элементы.Список.ТекущаяСтрока = ВыбранноеЗначение;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ХарактеристикаПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Характеристика) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
				Список, "Ключи.ХарактеристикаПерсонала", Характеристика, ВидСравненияКомпоновкиДанных.Равно,, Истина);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
				Список, "Ключи.ХарактеристикаПерсонала", Характеристика, ВидСравненияКомпоновкиДанных.Равно,, Ложь);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьИзБиблиотеки(Команда)
	
	ДополнительныеПараметры = Новый Структура;
	Для Каждого ЭлементОтбора Из Список.Отбор.Элементы Цикл
		Если ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТипВопроса") И ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно
			И ЭлементОтбора.Использование = Истина Тогда
			
			ДополнительныеПараметры.Вставить("ОтборТипВопроса", ЭлементОтбора.ПравоеЗначение);
		КонецЕсли;
	КонецЦикла;
	Если ЗначениеЗаполнено(Характеристика) Тогда
		ДополнительныеПараметры.Вставить("Характеристика", Характеристика);
	КонецЕсли;
	ОткрытьФорму("Справочник.ВопросыДляСобеседования.Форма.БиблиотекаВопросовДляСобеседования", ДополнительныеПараметры, ЭтотОбъект);	
	
КонецПроцедуры

#КонецОбласти
